//includes
#include <stdio.h>

//includes my librarys
#include "myLibrary.h"

/*Реализовать игру в «Space invaders», в которой
программа самостоятельно будет играть за игрока
(без интерактивности), используя генератор случайных чисел для определения его действий. Игровое поле должны отображаться в терминале и
постоянно обновляться. Флот пришельцев и снаряды игрока должны описываться при помощи
списков. Файл должен использоваться для записи
хода игры, с возможностью его воспроизведения
*/
int main()
{
    interfaceLoopForSpaceInvadersGame();
    return 0;
}